InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Листовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поганажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штучная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЕдиницыИзмеренияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмеренияНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Множитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботыОсновной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПеревода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементныеРасценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредварительнаяНоменклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омЕдиницыИзмерения/Ext/Module.bsl
&НаСервере
Функция ПолучитьЕдиницыИзмеренийНоменклатуры(Номенклатура, ПолныйНабор = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмеренияНоменклатуры.Коэффициент КАК Коэффициент,
	|	ЕдиницыИзмеренияНоменклатуры.Множитель КАК Множитель";
	Если ПолныйНабор Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ЕдиницыИзмеренияНоменклатуры.Ссылка КАК Ссылка,
		|	ЕдиницыИзмеренияНоменклатуры.Код КАК Код,
		|	ЕдиницыИзмеренияНоменклатуры.Наименование КАК Наименование";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
	|ГДЕ
	|	ЕдиницыИзмеренияНоменклатуры.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьКдиницыИзмеренийНоменклатуры()

&НаСервере
Функция ЗаписатьЕдиницыИзмерения(тзНовыеЗначения,Номенклатура) Экспорт
	тзТекущиеЗначения = ПолучитьЕдиницыИзмеренийНоменклатуры(Номенклатура,Истина);
	тзТекущиеЗначения.Колонки.Добавить("Обработан",Новый ОписаниеТипов("Булево"));
	
	Для каждого новыеЗначения Из тзНовыеЗначения Цикл
		Если новыеЗначения.Множитель = 0 Тогда
			новыеЗначения.Множитель = 1;
		КонецЕсли;
		НайденоеЗначение = Ложь;
		Для каждого текущиеЗначения Из тзТекущиеЗначения Цикл
			Если новыеЗначения.ЕдиницаИзмерения = текущиеЗначения.ЕдиницаИзмерения Тогда
				
				НайденоеЗначение = Истина;
				текущиеЗначения.Обработан = Истина;	
				
				Если НЕ (новыеЗначения.Коэффициент = текущиеЗначения.Коэффициент 
					И новыеЗначения.Множитель = текущиеЗначения.Множитель) Тогда
					
					обЕдиницыИзмеренияНоменклатуры = текущиеЗначения.Ссылка.ПолучитьОбъект();
					обЕдиницыИзмеренияНоменклатуры.Коэффициент = новыеЗначения.Коэффициент;
					обЕдиницыИзмеренияНоменклатуры.Множитель = новыеЗначения.Множитель;
					обЕдиницыИзмеренияНоменклатуры.Записать();	
				КонецЕсли;	
				
				Прервать;
				
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ НайденоеЗначение Тогда
			обЕдиницыИзмеренияНоменклатуры = Справочники.ЕдиницыИзмеренияНоменклатуры.СоздатьЭлемент();
			
			обЕдиницыИзмеренияНоменклатуры.Владелец = Номенклатура;
			обЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения = новыеЗначения.ЕдиницаИзмерения;
			обЕдиницыИзмеренияНоменклатуры.Коэффициент = новыеЗначения.Коэффициент;
			обЕдиницыИзмеренияНоменклатуры.Множитель = новыеЗначения.Множитель;
			обЕдиницыИзмеренияНоменклатуры.Записать();	
			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого текущиеЗначения Из тзТекущиеЗначения.НайтиСтроки(Новый Структура("Обработан", Ложь)) Цикл
		обЕдиницыИзмеренияНоменклатуры = текущиеЗначения.Ссылка.ПолучитьОбъект();
		обЕдиницыИзмеренияНоменклатуры.Удалить();
	КонецЦикла;
	
КонецФункции // ЗаписатьЕдиницыИзмерения()

&НаСервере
Функция ЕдиницыИзмеренийНоменклатурыДляВыбора(Номенклатура) Экспорт
	мЕдиницы = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат мЕдиницы;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
		|ГДЕ
		|	ЕдиницыИзмеренияНоменклатуры.Владелец = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕдиницыИзмеренияНоменклатуры.Наименование";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мЕдиницы.Добавить(Выборка.ОсновнаяЕдиницаИзмерения);
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мЕдиницы.Добавить(Выборка.ЕдиницаИзмерения);
	КонецЦикла;
	
    Возврат мЕдиницы;
КонецФункции // ЕдиницыИзмеренийНоменклатуры()

&НаСервере
Функция ПолучитьКоэффициентыЕИ(мЕдиницыМатериал, НеРавные_1 = Ложь) Экспорт
	ТипСтруктура = Тип("Структура");

	мЕдиницы = Новый Массив;
	Если НЕ НеРавные_1 Тогда
		мНоменклатура = Новый Массив;
	КонецЕсли;
	
	
	Для каждого текЕИ Из мЕдиницыМатериал Цикл
		Если ТипСтруктура = ТипЗнч(текЕИ) Тогда
			мЕдиницы.Добавить(текЕИ.ЕдиницыИзмерения);
			Если НЕ НеРавные_1 Тогда
				мНоменклатура.Добавить(текЕИ.мНоменклатура);
			КонецЕсли;
		Иначе
			мЕдиницы.Добавить(текЕИ.ЕдиницыИзмерения);
		КонецЕсли;		
	КонецЦикла; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмеренияНоменклатуры.Владелец КАК Номенклатура,
		|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕдиницыИзмеренияНоменклатуры.Коэффициент КАК Коэффициент,
		|	ЕдиницыИзмеренияНоменклатуры.Множитель КАК Множитель
		|ИЗ
		|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
		|ГДЕ
		|	ЕдиницыИзмеренияНоменклатуры.Ссылка В(&мЕдиницы)
		|	И ВЫБОР
		|			КОГДА &НеРавные_1
		|				ТОГДА ЕдиницыИзмеренияНоменклатуры.Коэффициент * ЕдиницыИзмеренияНоменклатуры.Множитель <> 1
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("мЕдиницы", мЕдиницы);
	Запрос.УстановитьПараметр("НеРавные_1", НеРавные_1);
	
	Если НЕ НеРавные_1 И мНоменклатура.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылкаа,
		|	Номенклатура.ОсновнаяЕдиницаИзмерения,
		|	1,
		|	1
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&мНоменклатура)";
		
		
		Запрос.УстановитьПараметр("мНоменклатура", мНоменклатура); 
		
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ПолучитьКоэффициентыЕИ()

&НаСервере
Функция ПолучитьКоэффициентНаСервере(Номенклатура,ЕдиницаИзмерения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиницыИзмеренияНоменклатуры.Коэффициент / ВЫБОР
		|		КОГДА ЕдиницыИзмеренияНоменклатуры.Множитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕдиницыИзмеренияНоменклатуры.Множитель
		|	КОНЕЦ КАК Коэффициент
		|ИЗ
		|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
		|ГДЕ
		|	ЕдиницыИзмеренияНоменклатуры.Владелец = &Номенклатура
		|	И ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатПакет[0].Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновнаяЕдиницаИзмерения = ЕдиницаИзмерения Тогда
			Возврат 1;
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатПакет[1].Выбрать();	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Коэффициент;
	КонецЦикла;
	
   Возврат 0;
КонецФункции // ПолучитьКоэффициентНаСервере(Материал,ЕдиницыИзмерения)()

&НаСервере
Функция ПолучитьЕдиницуПоУмолчанию(ТипЕдиницы = Неопределено) Экспорт
	
	Если ТипЕдиницы = Перечисления.ТипыНоменклатуры.Прочее Тогда
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК Значение,
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	

	Если ТипЕдиницы = Неопределено Тогда
		ИмяНастройки = Отчеты.ОбщиеНастройки.Создать().ПолучитьСписокИменРеквизитов();
		мВозврата = Новый Массив;
	Иначе
		ИмяНастройки = ТипЕдиницы;
	КонецЕсли;

	Запрос.УстановитьПараметр("ИмяНастройки",ИмяНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЕдиницы = Неопределено Тогда
			мВозврата.Добавить(Новый Структура(Выборка.ИмяНастройки,Выборка.Значение));	
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЕдиницы = Неопределено Тогда
		Возврат мВозврата;
	КонецЕсли;
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка(); 
	
КонецФункции // ПолучитьЕдиницуПоУмолчанию()

&НаСервере
Функция ПолучитьОсновнуюЕдиницуИзмерения(Номенклатура) Экспорт
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура.ОсновнаяЕдиницаИзмерения;
	КонецЕсли; 
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка(); 
	
КонецФункции // ПолучитьОсновнуюЕдиницуИзмерения()
